Public Attributes | List of all members
API_CalcAreaFormat Struct Reference
Project Settings
The API_CalcUnitPrefs structure contains this structure. More...
#include <APIdefs_Environment.h>
 Public Attributes
 API_AreaTypeID  | unit
The type of the area measurement unit.
 API_ExtraAccuracyID  | accuracy
European methods for rounding decimal values.
 short  | decimals
Number of decimals for area measurement unit [0..4].
Detailed Description
The API_CalcUnitPrefs structure contains this structure.